app/controllers/sourcedatabases_controller.rb

def destroy
 @sourcedatabase.destroy
---
DELETE FROM "sourcedatabases" WHERE "sourcedatabases"."id" = ?  [["id", 6]]

    def index
        @sourcedatabases = Sourcedatabase.all
---
SELECT "sourcedatabases".* FROM "sourcedatabases"

    def update

        if @sourcedatabase.update(sourcedatabase_params)
---
UPDATE "sourcedatabases" SET "Engine" = ?, "updated_at" = ? WHERE "sourcedatabases"."id" = ?  [["Engine", "oracle"], ["updated_at", "2016-11-28 01:18:17.222899"], ["id", 6]]

    def create
        #render plain: params[:sourcedatabase].inspect
       @sourcedatabase = Sourcedatabase.new(sourcedatabase_params)
       @sourcedatabase.user = User.first
       if @sourcedatabase.save
---
SELECT  "users".* FROM "users"  ORDER BY "users"."id" ASC LIMIT 1
INSERT INTO "sourcedatabases" ("DBName", "Engine", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["DBName", "NEW"], ["Engine", "Postgres"], ["created_at", "2016-11-28 00:29:13.243397"], ["updated_at", "2016-11-28 00:29:13.243397"]]

    def set_sourcedatabase
        @sourcedatabase = Sourcedatabase.find(params[:id])
---
SELECT  "sourcedatabases".* FROM "sourcedatabases" WHERE "sourcedatabases"."id" = ? LIMIT 1  [["id", 6]]