app/controllers/targetdatabases_controller.rb

  def index
    @targetdatabases = Targetdatabase.all
---
SELECT "targetdatabases".* FROM "targetdatabases"

  def create
    @targetdatabase = Targetdatabase.new(targetdatabase_params)

    respond_to do |format|
      if @targetdatabase.save
---
INSERT INTO "targetdatabases" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2016-11-27 05:20:31.650195"], ["updated_at", "2016-11-27 05:20:31.650195"]]

    def set_targetdatabase
      @targetdatabase = Targetdatabase.find(params[:id])
---
SELECT  "targetdatabases".* FROM "targetdatabases" WHERE "targetdatabases"."id" = ? LIMIT 1  [["id", 1]]